# IsWorksetVisible Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetDefaultVisibilitySettings..::..IsWorksetVisible Method
WorksetDefaultVisibilitySettings Class See Also
---
Indicates whether the workset is visible by default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsWorksetVisible(
	WorksetId worksetId
)
```

Visual Basic
---
```text
Public Function IsWorksetVisible ( _
	worksetId As WorksetId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsWorksetVisible(
	WorksetId^ worksetId
)
```

# ### Parameters
worksetId
    Type: Autodesk.Revit.DB..::..WorksetId Id of the workset.
# ### Return Value
Whether the workset is visible by default.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | There is no workset with this Id in the document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | WorksetDefaultVisibilitySettings is not applicable to family documents. |

# See Also
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace